Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་རྒྱལ་བ་ཅན་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: At that time, in a world called Land of Victory, there appeared a realized one, a worthy one, a perfectly awakened one, one perfected in knowledge and conduct, a sublime one, a knower of the world, an unsurpassable trainer of those ready to be trained, a teacher of gods and humans, a blessed buddha whose name was Vaiśramaṇa.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་ཞི་སྤྱོད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ཞི་སྤྱོད་དེ། རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱིས་ལུས་དང་སྲོག་ཀྱང་བཏང་སྟེ། བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ། །ཞེས་བྱང་ཆུབ་སེམས་དཔའི་གཏམ་འབའ་ཞིག་ཡང་དག་པར་སྟོན་ཏོ། །
en: The blessed realized one Vaiśramaṇa gave only teachings for bodhisattvas, such as, ‘Noble sons, you should practice with heroic effort, giving up even your body and life!’

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་སྟོབས་ཞེས་བྱ་བ་འཁོར་དེར་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “At that time, Great King, there was a bodhisattva named Śūrabala sitting in the assembly, and he said this to that blessed one:

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལུས་དང་སྲོག་ཀྱང་བཏང་སྟེ་བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ་ཞེས་དེ་སྐད་བཀའ་སྩལ་པ་ལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན།
en: “ ‘The Blessed One has said to the bodhisattvas that we should practice, giving up even our bodies and lives.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། །སྙམ་དུ་སེམས་པ་དེ་ནི་ལེ་ལོ་ཅན་དུ་གྲགས་པ་ལགས་པ་སྙམ་བདག་བགྱིད་དོ། །
en: Regarding the meaning of the Blessed One’s statement, I would ask if it is appropriate, Blessed One, to say that those bodhisattvas who think that they should quickly awaken to unsurpassable and perfect awakening should be known as slothful ones for thinking such a thing.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why do I say so?

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ནི་འཁོར་བ་ལ་ཡོངས་སུ་སྐྱོ་བའི་བློ་སྐྱེ་བར་མི་འགྱུར་ཏེ།
en: Blessed One, bodhisattvas who practice with heroic effort do not conceive the thought of being exhausted by saṃsāra.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་འཁོར་བ་ལ་ཕན་ཡོན་དུ་ལྟ་བ་ལགས་ཀྱི། མྱ་ངན་ལས་འདས་པ་ལ་ནི་དེ་ལྟ་མ་ལགས་ཏེ།
en: Blessed One, bodhisattvas hold the view that saṃsāra is something to be celebrated because it enables them to bring beings to maturity, but they do not view nirvāṇa in this way.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་པ་ལགས་སོ། །
en: Blessed One, bodhisattvas work on behalf of beings.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ལ་མོས་པ་རྣམས་ལ་འཁོར་བ་ནི་ཆེས་བདེའི། མྱ་ངན་ལས་འདས་པ་ནི་དེ་ལྟ་མ་ལགས་སོ། །
en: Blessed One, for bodhisattvas who are ardently devoted to heroic effort, saṃsāra is a great pleasure, but they do not view nirvāṇa in this way.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་པ་དེ་དག་ནི་ཇི་ལྟ་ཇི་ལྟར་སེམས་ཅན་རྣམས་ཀྱི་དོན་བགྱིད་པ་དེ་ལྟ་དེ་ལྟར་བདེ་བར་འགྱུར་ཏེ།
en: Blessed One, bodhisattvas who work on behalf of beings become happy to the degree that they do the work that benefits beings.

source: བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་སླད་ཀྱིས་ཅི་ཞིག་བགྱི་བར་འགྱུར།
en: “ ‘What is there to be done, Blessed One, by someone who has passed into nirvāṇa?

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་པས་བྱང་ཆུབ་སེམས་དཔས་འཁོར་བའི་བདེ་བའི་རོ་མི་མྱང་བར་འཁོར་བ་སྤྱོད་ཡུལ་དུ་བགྱི་སྟེ།
en: Bodhisattvas who think in this way, Blessed One, make saṃsāra their field of action even though the pleasures of saṃsāra do not have any flavor.

source: མྱ་ངན་ལས་འདས་པ་སྤྱོད་ཡུལ་དུ་མི་བགྱིའོ། །
en: They do not make nirvāṇa their field of action.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་བདེ་བའི་རོ་མི་མྱང་བར་འཁོར་བ་སྤྱོད་ཡུལ་དུ་བགྱིད་ཅིང་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་པ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མ་མཆིས་པ་མཐོང་བར་འགྱུར། ཆོས་ཚད་མ་མཆིས་པ་ཉན་པར་འགྱུར་ཞིང་སེམས་ཅན་ཚད་མ་མཆིས་པ་ཡོངས་སུ་སྨིན་པར་བགྱིད་དོ། །
en: Blessed One, bodhisattvas who make saṃsāra their field of action, even though the pleasures of saṃsāra do not have any flavor, and work on behalf of beings gain the vision of an immeasurable number of blessed buddhas, hear about the immeasurable nature of the Dharma, and bring an immeasurable number of beings to maturity.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་སྤྱོད་ཡུལ་དུ་བགྱིད་པ་ནི་སེམས་ཅན་གྱི་སྤྱོད་ཡུལ་གྱི་རྗེས་སུ་འཇུག་གོ། །
en: Blessed One, bodhisattvas who make saṃsāra their field of action become immersed in the field of action of beings.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས་འདས་པ་སྤྱོད་ཡུལ་དུ་བགྱིད་པ་ནི་བཏང་སྙོམས་སུ་ལྷུང་ལགས་སོ། །
en: Blessed One, bodhisattvas who take nirvāṇa as their field of action sink into apathy.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་སྤྱོད་ཡུལ་གྱིས་སྐྲག་ན་སྤྱོད་ཡུལ་མ་ལགས་པར་ལྷུང་སྟེ། སླད་ཀྱིས་སེམས་ཅན་གྱི་དོན་མི་བགྱིད།
en: When bodhisattvas are fearful of saṃsāra as a field of action, Blessed One, they fall into the state of having no field of action, and subsequently they do not work on behalf of beings.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་གནས་པར་མི་འགྱུར་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བར་མི་འགྱུར་ལགས་སོ། །
en: They do not become established in the field of action of the realized ones, and they do not become someone on whom all beings can depend.

source: དེའི་སྤྱོད་ཡུལ་མ་ལགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “ ‘What is the state of having no field of action?

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་འཚལ་ཞིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལ་གཡེལ་བ་ལགས་སོ། །
en: It is the state sought by disciples and solitary buddhas, a state of laxity in regard to the work of bringing beings to maturity.

source: བཅོམ་ལྡན་འདས་ཉན་ཐོས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་གང་ལགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་མ་ལགས་སོ། །
en: Blessed One, the disciple’s field of action is not the bodhisattva’s field of action.

source: བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ནི་འཁོར་བས་སྐྲག་པའི་སྤྱོད་ཡུལ་བ་ལགས་སོ། །
en: The field of action of the disciples and solitary buddhas is that of one who is afraid of saṃsāra.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཁོར་བ་དཔག་ཏུ་མ་མཆིས་པ་ཡོངས་སུ་འཛིན་པ་ལགས་ཏེ།
en: The bodhisattvas’ grasp of saṃsāra is immeasurable.

source: བཅོམ་ལྡན་འདས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་རང་གི་སྤྱོད་ཡུལ་ལ་གནས་པར་བགྱིའོ། །
en: In this respect, Blessed One, bodhisattvas dwell in their own field of action.’

source: རྒྱལ་པོ་ཆེན་པོ་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ཞི་སྤྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་སྟོབས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “This is what he said, Great King, and the realized one Vaiśramaṇa then said this to the bodhisattva Śūrabala: ‘Excellent, my good man, excellent!

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་པར་སྨྲས་པ་ལེགས་སོ་ལེགས་སོ། །
en: What you have said has been well said.

source: བྱང་ཆུབ་སེམས་དཔས་རང་གི་སྤྱོད་ཡུལ་གྱི་བྱ་བ་དག་ལ་གུས་པར་བྱ་སྟེ།
en: Bodhisattvas should be focused on what needs to be done in their own field of action.

source: རང་གི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པར་བྱའི། གཞན་གྱི་སྤྱོད་ཡུལ་ལ་སྤྱད་པར་མི་བྱའོ། །
en: They should work within their own field of action, and they should not work within the field of action of others.’

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རང་གི་སྤྱོད་ཡུལ་གང་ལགས། བཀའ་སྩལ་པ།
en: “ ‘What is the bodhisattvas’ own field of action, Blessed One?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རང་གི་སྤྱོད་ཡུལ་ནི་འདི་ལྟ་སྟེ། འཁོར་བ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་འཛིན་པས་མི་སྐྲག་པ་དང་།
en: “ ‘The bodhisattva’s own field of action, noble son, is the field of action of one who does not fear the immeasurable grasp of saṃsāra;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཕན་ཡོན་དང་།
en: one who celebrates the way of the bodhisattva;

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པ་མེད་པ་དང་།
en: one who does not wish for the level of a disciple or a solitary buddha;

source: ཉིང་མཚམས་སྦྱོར་བ་མེད་པར་ཡང་ཤེས་ལ་ཁམས་གསུམ་དུ་ཡང་མཚམས་སྦྱོར་བ་དང་། སེལ་བ་དང་། སྡུད་པ་དང་།
en: one who gathers the means to sever the connection to rebirth in the three worlds, while knowing that there is no such connection;

source: དགེ་བའི་རྩ་བ་རྣམས་སྤེལ་བ་དང་།
en: one who is skilled in the ways of making the roots of virtue grow;

source: ཚུལ་ལ་མཁས་པ་དང་།
en: one who knows the means of drawing others to oneself;

source: བསྡུ་བ་ཤེས་པ་དང་། དགེ་བ་ཐམས་ཅད་སོགས་པ་ལ་མཁས་པ་དང་།
en: one who is skilled in accumulating all virtues;

source: ཟད་པ་ཡང་ཤེས་ལ་བསོད་ནམས་ཀྱི་ཚོགས་མི་ཟད་པ་ལ་ཡང་མཁས་པ་དང་།
en: one who is skilled in not using up the supply of one’s merit, while understanding the nature of extinction;

source: སྐྱེ་བ་མེད་པ་ཡང་རབ་ཏུ་རྟོགས་ལ་བསམས་བཞིན་དུ་སྐྱེ་བ་ལ་ཡང་མཁས་པ་དང་།
en: and one who is skilled in deliberately being reborn while realizing what is never born.

source: སེམས་ཅན་ཡང་མེད་ལ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་ཡང་མཁས་པ་དང་།
en: “ ‘It is the field of action of one who is skilled in bringing beings to maturity, even though there is no such thing as a being;

source: ཆོས་ཐམས་ཅད་དབེན་པར་ཡང་ཤེས་ལ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་ཡང་མཁས་པ་དང་།
en: one who is skilled in grasping the true Dharma, while knowing all things to be isolated and free;

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནམ་མཁའི་རང་བཞིན་དུ་ཡང་ཤེས་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བ་ལ་ཡང་མཁས་པ་དང་།
en: one who is skilled in purifying a buddha domain, while knowing that space is the true nature of all buddha domains;

source: སངས་རྒྱས་ཐམས་ཅད་ཆོས་ཀྱི་སྐུ་ཡིན་པར་ཡང་ཤེས་ལ་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་རྒྱན་རྣམ་པར་བསྒྲུབ་པ་ཡོངས་སུ་ཚོལ་བ་ལ་ཡང་མཁས་པ་དང་།
en: one who is skilled in the acquisition of the distinctive features and secondary marks of a great being, while knowing that one possesses the Dharma body of all the buddhas;

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པར་ཡང་ཤེས་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མངོན་པར་འདུ་བྱ་བའི་རྒྱུན་མི་གཅོད་པ་ལ་ཡང་མཁས་པ་དང་།
en: one who is skilled in not severing the roots of virtue, which are themselves conditioned things, while knowing what is unconditioned;

source: འདུས་བྱས་ཀྱི་ཆོས་ཀྱང་ཡོངས་སུ་སྦྱོད་ལ་དོན་ཉུང་ཞིང་བྱ་བ་ཉུང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཅི་བྱའོ་ཅོག་ལ་ཡང་མཁས་ལ་ལུས་དང་སེམས་དབེན་པར་དགའ་བ་ཡང་ཤེས་པ་དང་།
en: and one who knows the joy that is the isolated and free state of one’s mind and body, while being skilled in doing what all beings need done, even when there is little need and little desire for the enjoyment of conditioned things.

source: ཆོས་བསྟན་པ་ཡང་མི་འདོར་ལ་སྨྲ་བ་ལ་སྨད་པ་ལ་ཡང་མཁས་པ་དང་།
en: “ ‘It is the field of action of one who is wise to censure those who argue their positions, and yet does not fail to teach the Dharma;

source: བསམ་གཏན་ཡང་སྐྱེད་ལ་བསམ་གཏན་གྱི་རོ་མྱང་བར་ཡང་མི་བྱེད་པ་དང་།
en: one who does not relish the flavor of meditative concentration, while still producing a state of meditative concentration;

source: ཆོས་ཟབ་མོ་རྟོགས་པ་ཡང་ཤེས་ལ་སེམས་ཅན་གྱི་སྤྱོད་པ་སྣ་ཚོགས་ཀྱི་རྗེས་སུ་ཡང་འཇུག་ཅིང་གཏམ་ཡང་དག་པར་སྟོན་པ་ལ་ཡང་མཁས་པ་དང་།
en: one who is skilled in revealing teachings and engaging in the various actions of beings, while still comprehending the profound Dharma;

source: འབྱུང་བ་མེད་པར་ཡང་ཤེས་ལ་བསམས་བཞིན་དུ་སྲིད་པ་ཡང་ཡོངས་སུ་འཛིན་པ་དང་།
en: one who deliberately grasps the world of becoming, even while knowing what does not arise at all;

source: ལྷག་མཐོང་ཡང་ཤེས་ལ་འབྲས་བུ་ཐོབ་པར་མི་བྱེད་པ་ལ་ཡང་མཁས་པ་དང་།
en: one who knows deep insight, but is skilled in not causing oneself to obtain the fruit of such knowledge;

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡུལ་ཡང་ཡིན་ལ་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བ་འདོད་པའི་རྒྱུན་མི་གཅོད་པ་ལ་ཡང་མཁས་པ་དང་།
en: one who is skilled in not cutting the thread of desire for the liberation of the realized ones, while still being within the range of the disciples and the solitary buddhas;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མི་འདོར་བ་ཡང་ཤེས་ལ་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་ལྟ་བ་ལ་ཡང་མཁས་པ་སྟེ།
en: and one who is skilled in seeing the range of the buddhas, while still knowing not to neglect the actions of a bodhisattva.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རང་གི་སྤྱོད་ཡུལ་ལོ། །
en: This, noble son, is the bodhisattvas’ own field of action.’

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་སྟོབས་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ཞི་སྤྱོད་ལས་སྤྱོད་ཡུལ་ཡོངས་སུ་དག་པ་བསྟན་པ་འདི་ཐོས་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རང་གི་སྤྱོད་ཡུལ་ཡོངས་སུ་དག་པ་བསྟན་པ་འདི་ལེགས་པར་གསུངས་པ་ནི་ངོ་མཚར་ལགས་སོ། །
en: “When the bodhisattva Śūrabala heard this teaching from the blessed realized one Vaiśramaṇa on the purification of the field of action, Great King, he was awestruck, and he said this to that realized one: ‘It is marvelous, Blessed One, how well the Realized One has expressed this teaching on the purification of the bodhisattvas’ own field of action!

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་གིས་འཚལ་བ་དང་། བདག་སེམས་པ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པའི་རང་གི་སྤྱོད་ཡུལ་ནི་ཆོས་ཐམས་ཅད་ལགས་པ་སྙམ་བགྱིད་དོ། །
en: “ ‘If I were to express my own understanding of the meaning of what the Blessed One has just taught, I would say that bodhisattvas who have mastered skill in means have all things as their own field of action.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གནས་གང་ལགས་པ་དང་གཟུགས་སྣང་བ་ཐམས་ཅད་ལ་མི་སྒྲིབ་པ་དང་། །ནམ་མཁའི་སྤྱོད་ཡུལ་སྒྲིབ་པ་མ་མཆིས་པས་གཟུགས་སུ་གདའ་བ་ཐམས་ཅད་ནི་ནམ་མཁའི་སྤྱོད་ཡུལ་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བས་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པའི་སྤྱོད་ཡུལ་ནི་ཆོས་ཐམས་ཅད་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གནོད་པ་མ་མཆིས་པའི་སླད་དུ་གཟུགས་སུ་གདའ་བ་ཐམས་ཅད་ནི་ནམ་མཁའི་སྤྱོད་ཡུལ་ལགས་ཏེ། དུག་གི་ཤིང་ལྗོན་པའམ། སྨན་གྱི་ཤིང་ལྗོན་པའམ།
en: Just as, Blessed One, space has a field of action that has all forms as its appearance, because it has no resting place, because the appearances of all forms are by nature without obstruction, and because the range of action of space is by nature without obstruction, in precisely the same way, Blessed One, bodhisattvas who have mastered skill in means have all things as their own field of action, because they have the nature of perfect and complete awakening.

source: ཚེར་མ་ཅན་གྱི་ཤིང་ལྗོན་པའམ། མེ་ཏོག་གི་ཤིང་ལྗོན་པའམ། འབྲས་བུའི་ཤིང་ལྗོན་པའམ། སྤོས་ཀྱི་ཤིང་ལྗོན་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ནི་ནམ་མཁའ་ལས་རྣམ་པར་འཕེལ་ཡང་ནམ་མཁའ་ནི་དེ་དག་གིས་ཀུན་ནས་ཉོན་མོངས་པར་ཡང་མི་འགྱུར། རྣམ་པར་བྱང་བར་ཡང་མི་འགྱུར། རྗེས་སུ་ཆགས་པར་ཡང་མི་འགྱུར། ཁོང་ཁྲོ་བར་ཡང་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་ཤེས་རབ་ལས་ངེས་པར་བྱུང་བའི་རང་གི་སྤྱོད་ཡུལ་ནི་ཆོས་ཐམས་ཅད་ལགས་ཏེ། སོ་སོ་སྐྱེ་བོའི་ཆོས་གང་དག་ལགས་པ་དང་། སློབ་པའི་ཆོས་དང་། མི་སློབ་པའི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་གང་དག་ལགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་གང་དག་ལགས་པ་རྣམས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། །དེ་དག་ཐམས་ཅད་ནི་དེས་མངོན་པར་རྫོགས་པར་རྟོགས་པར་བགྱི་བ་ལགས་སོ། །
en: “ ‘To draw another analogy, Blessed One, just as space has a field of action that has all forms as its appearance, because it is not injured thereby, in the sense that whatever poisonous trees, medicinal trees, thorny trees, flowering trees, fruit trees, and fragrant trees there are, all of them grow in space, and yet space is not sullied or cleansed by them, and it does not become stuck on them or repelled by them, in precisely the same way, Blessed One, bodhisattvas who have mastered skill in means and become adept at wisdom have all things as their own field of action, including the qualities of ordinary people, the qualities of those who are still undergoing training and of those who have reached the stage of no more training, the qualities of the solitary buddhas, and the qualities of bodhisattvas, as well as the qualities of the realized ones, for the reason that all these qualities are things to which the bodhisattva should become perfectly and completely awakened.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ཞུགས་ནི་རྩྭའམ་ནགས་ཚལ་གང་ཡང་རུང་སྟེ། དེ་ལས་མི་འབྲོས་ཀྱི་དེ་དག་ཐམས་ཅད་ནི་མེ་སྒྲོན་གསལ་བར་འབར་བར་བགྱིད་པས་ཕན་པར་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་མེ་སྒྲོན་འབར་བར་བགྱིད་པས་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་རང་གི་སྤྱོད་ཡུལ་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱིད་ན་ཚན་པོ་ཆེའི་ལུས་ནི་ཞུགས་ཀྱིས་མི་ཚིག །
en: “ ‘Indeed, Blessed One, to make another analogy, just as there is no grass or type of wood whatsoever that can escape from fire, but all of them can be made into something useful when set alight as a burning torch, in precisely the same way, Blessed One, bodhisattvas have all things as their own field of action, because they are set alight by the burning torch of wisdom.

source: མཚོན་གྱིས་མི་ཁུམས། དུག་གིས་མི་ཁུམས་ཏེ། དེ་ཕ་རོལ་གྱི་གནོད་པས་མི་ཚུགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱང་ཉན་ཐོས་དང་འདྲིས་པར་བགྱིད་པ་དང་། རང་སངས་རྒྱས་དང་འདྲིས་པར་བགྱིད་པ་དང་། ཉོན་མོངས་པ་དང་འདྲིས་པར་བགྱིད་པས་ཞི་བར་བགྱིད་མི་ནུས་ཏེ། དེ་ཇི་ལྟ་ཇི་ལྟར་འདྲིས་པར་བགྱིད་པ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་མཐོང་ལ་བརྩོན་པ་ཤེས་རབ་གསལ་བར་འགྱུར་རོ། །
en: “ ‘Indeed, Blessed One, just as the body of a being with a great physique cannot be burned by fire, pierced by a weapon, or killed by poison, and it is not an object of attack by another, in precisely the same way, Blessed One, the knowledge and wisdom of a bodhisattva cannot be subdued by close acquaintance with disciples, by close acquaintance with solitary buddhas, or by close acquaintance with the afflictions—and what is more, the closer a bodhisattva’s acquaintance with them becomes, the more a bodhisattva comes to be fixed on deep insight and refines wisdom.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ནོར་བུ་རིན་པོ་ཆེ་ཆབ་དང་བར་བགྱིད་པ་ནི་རྙོག་པ་ཐམས་ཅད་དང་བར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་རིན་པོ་ཆེ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་དང་བར་བགྱིད་དོ། །
en: “ ‘To draw another analogy, Blessed One: just as a water-purifying precious jewel purifies water of all pollutants, in precisely the same way, Blessed One, the bodhisattva’s jewel of wisdom purifies beings of the filth of all the afflictions.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་སྨན་གྱི་རིགས་འབྲལ་བྱེད་ཅེས་བགྱི་བ་དེ་ནི་དུག་དང་ལྷན་ཅིག་ཏུ་ཡང་མི་གནས་ལ་དུག་ཐམས་ཅད་ཀྱང་ཞི་བར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་དང་ཤེས་རབ་བསྒོམ་པ་ཡང་སེམས་ཅན་གྱི་ཉོན་མོངས་པའམ། རང་གི་ཉོན་མོངས་པ་རྣམས་དང་ལྷན་ཅིག་མི་གནས་ཤིང་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་ཞི་བར་བགྱིད་དེ།
en: “ ‘Indeed, Blessed One, to make one more analogy, just as the medicine known as a purgative does not remain in the body along with the poison, but eliminates all the poison, in precisely the same way, Blessed One, a bodhisattva’s cultivation of wisdom and skill in means does not remain along with beings’ afflictions or the bodhisattva’s own afflictions, but eliminates the poison of all afflictions.

source: བཅོམ་ལྡན་འདས་རྣམ་གྲངས་འདིས་ན་ཆོས་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་རང་གི་སྤྱོད་ཡུལ་ལགས་སོ། །
en: In this manner, Blessed One, bodhisattvas have all things as their own field of action.’

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་སྟོབས་ཀྱིས་དེ་སྐད་བསྟན་པ་ན་སྲོག་ཆགས་བརྒྱད་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉིས་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: “When the bodhisattva Śūrabala gave this instruction, Great King, eight thousand beings conceived the aspiration for unsurpassable and perfect awakening, and two hundred bodhisattvas gained the acceptance of that fact that things do not arise.

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ཞི་སྤྱོད་ཀྱི་གསུང་རབ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་སྟོབས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Moreover, if you were to think, Great King, that the bodhisattva Śūrabala, when he was in dialogue with the realized one, the blessed Vaiśramaṇa, was someone else at that moment and time, then it should not be seen in that way.

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་སྟོབས་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: The bodhisattva Śūrabala at that moment and time was this very Lord of the Guhyakas, Vajrapāṇi.

source: རྒྱལ་པོ་ཆེན་པོ་སྐྱེས་བུ་དམ་པ་འདི་ནི་བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་བརྟན་པོ་འདི་ལྟ་བུ་བགོས་སོ། །དེ་ལྟར་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་སོ། །
en: As such, Great King, this good man is, indeed, arrayed with the strong armor of heroic effort as well as someone who has attended upon many buddhas.”

source: དཔའ་སྟོབས་ཀྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་རྩ་གཅིག་པའོ།། །།
en: This was the twenty-first chapter, “On Śūrabala.” Chapter 22: The Explanation of Ajātaśatru’s Questions

source: དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་སྙམ་དུ་སེམས་ཏེ། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་ལག་པ་གཡས་པ་ན་རྡོ་རྗེ་ཐོགས་པ་དེ་ཅི་ལྕི་བ་ཞིག་གམ། འོན་ཏེ་ཡང་བ་ཞིག །གང་གི་ཕྱིར་ན་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་སྟོབས་ཀྱི་ཤུགས་ཆེན་པོ་བདོག་པ་ཞེས་བྱ་སྙམ་མོ། །
en: At that point, it occurred to King Ajātaśatru, “The vajra that Vajrapāṇi, Lord of the Guhyakas, is holding in his right hand must be heavy, because if it is light, why is Vajrapāṇi, Lord of the Guhyakas, said to possess incredibly great strength?”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་རྡོ་རྗེ་འདི་ནི་ལྕི་བ་ཡང་ཡིན་ལ་ཡང་བ་ཡང་ཡིན་ནོ། །
en: Then, knowing with his own mind the train of thought of King Ajātaśatru, Vajrapāṇi, Lord of the Guhyakas, said to him, “It is, indeed, heavy, Great King, and it is light.”

source: སྨྲས་པ། ཅིའི་ཕྱིར་ན་ལྕི་བ་ཡིན་ལ་ཇི་ལྟར་ན་ཡང་བ་ཡང་ཡིན།
en: “For what reason is it heavy, and how is it light?”

source: སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་སེམས་ཅན་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པས་སྙེམས་པ་རྣམས་ཡོངས་སུ་གདུལ་བའི་ཕྱིར་ལྕི་བ་ཡིན་ནོ། །
en: “It is heavy, Great King, in order to gain full control over beings who are arrogant, conceited, haughty, and overly proud.

source: སེམས་ཅན་ང་རྒྱལ་མེད་པ་དང་། དྲང་བ་རྣམས་ལ་ནི་ཡང་བ་ཡིན་ནོ། །
en: For beings who are honest and humble, it is light.”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ས་ཕྱོགས་དེ་རྡོ་རྗེར་བྱིན་གྱིས་བརླབས་ནས་རྡོ་རྗེ་དེ་སའི་སྟེང་དུ་བཞག་པ་དང་།
en: Vajrapāṇi, Lord of the Guhyakas, then used his empowering authority and made that spot of earth into vajra, and he placed his vajra on that ground.

source: དེ་བཞག་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ། །
en: Just as soon as he set it down, the cosmos of a billion worlds quaked in six ways.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་རྡོ་རྗེ་འདི་སའི་སྟེང་འདི་ནས་ཐེག་ཤིག །
en: Vajrapāṇi, Lord of the Guhyakas, then said to King Ajātaśatru, “Lift this vajra off the ground, Great King.”

source: དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཚན་པོ་ཆེན་པོའི་སྟོབས་ཀྱི་ཤུགས་ཆེན་པོ་དང་ལྡན་པས་རྡོ་རྗེ་དེ་སྟོབས་ཀྱི་ཤུགས་ཐམས་ཅད་ཀྱིས་འདེག་པར་བསྐྱོད་ན་སྐྲའི་རྩེ་མོ་ཙམ་ཡང་བསྐྱོད་པའམ། བསྒུལ་བར་མ་ནུས་ནས་དེ་ངོ་མཚར་དུ་གྱུར་ཏེ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, as someone with the incredible strength of a being with a great physique, King Ajātaśatru thought, “I will lift this vajra,” but with all his incredible strength he could not move or budge it, even to the slightest degree.

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཚན་པོ་ཆེན་པོའི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་ཏེ། གོ་ཆ་དང་ཡ་ལད་བསྐོན་པའི་གླང་པོ་ཆེ་ཡང་ལག་པ་ཡ་ཅིག་གིས་གདེག་པའི་རྔོ་ཐོག་ན། བདག་གིས་རྡོ་རྗེ་འདི་ལྟར་ཆུང་བ་འདི་བསྐྱོད་པའམ། བསྒུལ་བའི་རྡོ་ཡང་མ་ཐོག་ན། གདེག་པར་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ།
en: Awestruck, he stretched out his arms, palms together in a gesture of salutation, and said to the Blessed One, “With the incredible strength of a being with a great physique, I can lift an elephant that is fully arrayed with armor with one hand, but, Blessed One, I cannot move or budge this mere trifle of a vajra in the slightest, not to speak of lifting it.

source: འདི་ལ་རྒྱུ་ཅི་ཞིག་མཆིས།
en: What is the reason?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་རྡོ་རྗེ་འདི་ནི་ལྕི་ཡིས།
en: “Great King,” the Blessed One answered, “this vajra is heavy.
